/********************************************************
 * 版权：苏州欧姆尼克新能源科技有限公司软件组
 * 文件名称：Lib_SoftStart.c
 * 修改人：陈波
 * 修改日期：2015.10.20
 * 描述：软启动控制；
 * 修改内容：
 *******************************************************/

/********************************************************************
 * Include Files
 ********************************************************************/
#include "App.h"

/********************************************************************
 * Local Types
 ********************************************************************/
INT32U lulStartCnt;
INT32U lulMaxStartCnt;

/*****************************************************************************
 * 函数名称：启动计数器设置函数。
 * 函数输入：启动计数器数值。
 * 函数返回值：无。
 * 函数描述：
 ****************************************************************************/
void sSetStartCnt(INT32U lulStartCntTemp)
{
	if(lulStartCntTemp > lulMaxStartCnt)
	{
		lulStartCnt = lulMaxStartCnt;
	}
	else
	{
		lulStartCnt = lulStartCntTemp;
	}
}

/*****************************************************************************
 * 函数名称：计数器最大值获得函数。
 * 函数输入：计数器最大值。
 * 函数返回值：无。
 * 函数描述：
 ****************************************************************************/
void sSetMaxStartCnt(INT32U lulMaxStartCntTemp)
{
	if(lulMaxStartCntTemp)
	{
		lulMaxStartCnt = lulMaxStartCntTemp;
	}
	else
	{
		lulMaxStartCnt = 10000;
	}
}

/*****************************************************************************
 * 函数名称：启动功率百分比获得函数。
 * 函数输入：无。
 * 函数返回值：启动功率百分比。
 * 函数描述：每调用一次此函数，内部计数器加1，返回内部计数器与计数器最大值的
 * 			 百分比。当内部计数器超过计数器最大值时，内部计数器被强制设为计数
 * 			 器最大值。
 ****************************************************************************/
#ifdef FloatEnable
float sGetStartPercent(void)
{
	if(lulMaxStartCnt)
	{
		if(++lulStartCnt >= lulMaxStartCnt)
		{
			lulStartCnt = lulMaxStartCnt;
		}

		return((float)lulStartCnt / lulMaxStartCnt);
	}

	return(c0Percent);
}
#else
#endif
