/********************************************************
 * 版权：苏州欧姆尼克新能源科技有限公司软件组
 * 文件名称：Lib_ClearRam.c
 * 修改人：沈仕强
 * 描述：通讯
 * 初版日期：2015.06.04
 * 更改内容：
 *******************************************************/

/********************************************************************
 * Include Files
 ********************************************************************/
#include "App.h"

/*****************************************************************************
 * 函数名称：ram数据字节清零函数
 * 函数输入：无
 * 函数返回值：无
 * 函数描述：将源地址到源地址加长度的数据清零。
 ****************************************************************************/
void sClearRamByte(INT8U *lubDim,INT32U lulLen)
{
	while(lulLen--)
	{
		*lubDim++ = 0;
	}
}

/*****************************************************************************
 * 函数名称：ram数据字清零函数
 * 函数输入：无
 * 函数返回值：无
 * 函数描述：将源地址到源地址加长度的数据清零。
 ****************************************************************************/
void sClearRamWord(INT16U *luwDim,INT32U lulLen)
{
	while(lulLen--)
	{
		*luwDim++ = 0;
	}
}

/*****************************************************************************
 * 函数名称：ram数据双字清零函数
 * 函数输入：无
 * 函数返回值：无
 * 函数描述：将源地址到源地址加长度的数据清零。
 ****************************************************************************/
void sClearRamLong(INT32U *lulDim,INT32U lulLen)
{
	while(lulLen--)
	{
		*lulDim++ = 0;
	}
}
