/********************************************************
 * 版权：苏州欧姆尼克新能源科技有限公司软件组
 * 文件名称：I2C.c
 * 修改人：陈波
 * 修改日期：2015.04.14
 * 描述：发电量计算
 *******************************************************/

/********************************************************************
 * Include Files
 ********************************************************************/
#include "App.h"
#include "Lib_Communication.h"

/********************************************************************
 * Local Types
 ********************************************************************/
INT8U lub1MinCnt;

INT32U lulPower1MinTD;
INT32U lulPower1MinTT;

/*****************************************************************************
 * 函数名称：发电量计算函数。
 * 函数输入：当前功率。
 * 函数返回值：数据存储标志位。
 * 函数描述：在运行状态下1s调用此函数一次
 ****************************************************************************/
INT8U sEnergyCal(INT16U luwPower)
{
	lulPower1MinTD += luwPower;
	lulPower1MinTT += luwPower;
	
	if(++lub1MinCnt >= 60)										//时间基准1s
	{
		Energy.data.ulTodayEnergy += lulPower1MinTD / 36000;	//精度为0.01kWh
		Energy.data.ulTotalEnergy += lulPower1MinTT / 360000;	//精度为0.1kWh

		lub1MinCnt = 0;
		lulPower1MinTD %= 36000;
		lulPower1MinTT %= 360000;
		return(cTrue);
	}
	return(cFalse);
}
